Tekla Open API Reference for Tekla Structures 2025
PluginCoordinateSystemAttribute Constructor
Overload List
Name | Description
PluginCoordinateSystemAttribute(Int32)
 The custom attribute used to define coordinate system of the plug-in. This is not to be used by itself.
PluginCoordinateSystemAttribute(PluginBase.CoordinateSystemType)
 The custom attribute used to define coordinate system of the plug-in. This is not to be used by itself.
Top
See Also
Reference
PluginCoordinateSystemAttribute Class
Tekla.Structures.Plugins Namespace